{
  "posts": [
    {
      "id": 1,
      "title": "Joker Movie Goes After Deadpool 2 Star Zazie Beetz",
      "author": "Kevin Burwick",
      "time": "2018-07-19",
      "content": "<div><span class=\"short-text\">Deadpool 2 Star Zazie Beetz is in talks to join the cast of the Joker Origin Movie, which stars Joaquin Phoenix as the Clown Prince of Crime. It was recently announced that the official title for the movie will be Joker and the official release date is October 4th, 2019. Since the official release date is so soon, it looks like the initial reports about a production start in September are pretty accurate, though nothing has been confirmed at this time.</span><span class=\"long-text\"><br>Zazie Beetz is reportedly in talks to play a single mother who catches the eye of the man who becomes the Joker in the film. That's all of the information that has been released at this time. This is the first bit of casting news that has been officially reported outside of Joaquin Phoenix taking on the main role in the Joker Origin Movie. Robert De Niro is rumored to be in talks as well, but his name was not mentioned in the latest report, which could mean that the actor isn't going to be in the movie after all.<br>Hangover director Todd Phillips is helming the Joker Origin Movie and he co-wrote it with Scott Silver. The DC movie is going to take place under a new banner outside of the DCEU and will be a moderately budgeted affair. While not much is clear about the plot, it is believed that the Joker Origin Movie will be a much darker movie than we've seen from Warner Bros. and DC Films, which sounds pretty interesting. Taxi Driver and The King of Comedy are reportedly where the project is drawing its inspiration from.<br>Joaquin Phoenix recently spoke about his decision to take on the role of the Joker and revealed that he's wanted to do a character study on a comic book villain for quite some time. However, Phoenix never imagined that it would be for a Joker Origin Movie. The actor believed that the part had been played too many times by too many good actors over the years. Jack Nicholson, Heath Ledger, and Jared Leto have all played the Clown Prince of Crime in the span of nearly 30 years.<br>DC fans weren't exactly happy with the direction that Jared Leto took the Joker. He was more of a hipster-looking character with tattoos and gold teeth, as opposed to the utterly unhinged version that Heath Ledger played and the semi-campy version that Jack Nicholson did. With that being said, a lower budget Joker Origin Movie with less pressure seems perfect for Joaquin Phoenix to come in and quietly command the role. But, anything having to do with the world of Batman is going to be a pretty big deal, no matter what, so it will be cool to see what Phoenix brings to the table. You can head over to The Hollywood Reporter to read more about Zazie Beetz joining the cast of the Joker Origin Movie.</span><span class=\"text-dots\">....</span><span class=\"show-more-button\" data-more=\"0\">Read More</span></div>",
      "content2": "Deadpool 2 Star Zazie Beetz is in talks to join the cast of the Joker Origin Movie, which stars Joaquin Phoenix as the Clown Prince of Crime. It was recently announced that the official title for the movie will be Joker and the official release date is October 4th, 2019. Since the official release date is so soon, it looks like the initial reports about a production start in September are pretty accurate, though nothing has been confirmed at this time.<br>Zazie Beetz is reportedly in talks to play a single mother who catches the eye of the man who becomes the Joker in the film. That's all of the information that has been released at this time. This is the first bit of casting news that has been officially reported outside of Joaquin Phoenix taking on the main role in the Joker Origin Movie. Robert De Niro is rumored to be in talks as well, but his name was not mentioned in the latest report, which could mean that the actor isn't going to be in the movie after all.<br>Hangover director Todd Phillips is helming the Joker Origin Movie and he co-wrote it with Scott Silver. The DC movie is going to take place under a new banner outside of the DCEU and will be a moderately budgeted affair. While not much is clear about the plot, it is believed that the Joker Origin Movie will be a much darker movie than we've seen from Warner Bros. and DC Films, which sounds pretty interesting. Taxi Driver and The King of Comedy are reportedly where the project is drawing its inspiration from.<br>Joaquin Phoenix recently spoke about his decision to take on the role of the Joker and revealed that he's wanted to do a character study on a comic book villain for quite some time. However, Phoenix never imagined that it would be for a Joker Origin Movie. The actor believed that the part had been played too many times by too many good actors over the years. Jack Nicholson, Heath Ledger, and Jared Leto have all played the Clown Prince of Crime in the span of nearly 30 years.<br>DC fans weren't exactly happy with the direction that Jared Leto took the Joker. He was more of a hipster-looking character with tattoos and gold teeth, as opposed to the utterly unhinged version that Heath Ledger played and the semi-campy version that Jack Nicholson did. With that being said, a lower budget Joker Origin Movie with less pressure seems perfect for Joaquin Phoenix to come in and quietly command the role. But, anything having to do with the world of Batman is going to be a pretty big deal, no matter what, so it will be cool to see what Phoenix brings to the table. You can head over to The Hollywood Reporter to read more about Zazie Beetz joining the cast of the Joker Origin Movie.",
      "image": "/images/joker.jpg"
    },
    {
      "id": 2,
      "title": "Iron Man 3 Director Disses Infinity War",
      "author": "Kevin Burwick",
      "time": "2018-07-19",
      "content": "<div><span class=\"short-text\">The Predator director Shane Black is no stranger to the Marvel Cinematic Universe, having directed 2013's Iron Man 3. While speaking at San Diego Comic-Con, Black took a second to throw some shade at Avengers: Infinity War and Thanos' abilities as a villain. Shane Black is in San Diego to promote his upcoming The Predator and he appeared with the cast at Hall H this morning to show off some new footage and a hilarious sizzle reel that had the cast thinking about other battles that a Predator could win. Could Thanos get beaten down by a Predator?</span><span class=\"long-text\"><br>While speaking to the packed crowd in Hall H at Comic-Con, Shane Black took a second away from promoting The Predator to take a shot at Infinity War, which is the most successful film of the year to be released this far. It seems that Black had some issues about the power of Thanos and how easily the young Spider-Man was able to get in some pretty decent shots on a dude that easily took down the Hulk with less Infinity Stones. It's a fair argument. Black had this to say.<br>\"One moment there's a train coming at him he can turn it into a flock of birds. The next minute Spider-Man is coming at him and he's like, Oh, my eyes! It's got webbing! I loved the movie, it's just, the kid had to do something, so...\"<br>In fairness to Spider-Man, he did have the help of Doctor Strange when he was able to slightly get the upper hand on the Mad Titan. But, there are plenty of MCU fans that would agree with Shane Black's stance on the uneven fight. We probably wouldn't even still be talking about it had Star-Lord not blown the whole operation. Regardless, Infinity War is the biggest movie of the year without any real signs of competition, so the Russo Brothers and Spider-Man are having the last laugh.<br>Shane Black was just having some fun with Infinity War and Josh Brolin's Thanos. But that brings up the real question, which is who would win between the Mad Titan and a Predator? Though we have yet to see the Upgrade Predator in total action yet, it's safe to say that it might have a chance to bring down Thanos pretty easily. He could rip off his giant purple head, spine and all. But if it's just a normal Predator, there's probably no chance of survival against Thanos.<br>Everybody is entitled to their opinions, but Shane Black's Iron Man 3 wasn't exactly everybody's favorite MCU movie. In fact, many hardcore fans really dislike it. However, like Infinity War, it made over $1 billion at the box office, so Black gets to laugh about all of it just like the Russo Brothers and poor Spider-Man, may he rest in peace. Black's The Predator opens in theaters on September 14th, which is just a few months away. This report originated from Comic Book.</span><span class=\"text-dots\">....</span><span class=\"show-more-button\" data-more=\"0\">Read More</span></div>",
      "content2": "The Predator director Shane Black is no stranger to the Marvel Cinematic Universe, having directed 2013's Iron Man 3. While speaking at San Diego Comic-Con, Black took a second to throw some shade at Avengers: Infinity War and Thanos' abilities as a villain. Shane Black is in San Diego to promote his upcoming The Predator and he appeared with the cast at Hall H this morning to show off some new footage and a hilarious sizzle reel that had the cast thinking about other battles that a Predator could win. Could Thanos get beaten down by a Predator?<br>While speaking to the packed crowd in Hall H at Comic-Con, Shane Black took a second away from promoting The Predator to take a shot at Infinity War, which is the most successful film of the year to be released this far. It seems that Black had some issues about the power of Thanos and how easily the young Spider-Man was able to get in some pretty decent shots on a dude that easily took down the Hulk with less Infinity Stones. It's a fair argument. Black had this to say.<br>\"One moment there's a train coming at him he can turn it into a flock of birds. The next minute Spider-Man is coming at him and he's like, Oh, my eyes! It's got webbing! I loved the movie, it's just, the kid had to do something, so...\"<br>In fairness to Spider-Man, he did have the help of Doctor Strange when he was able to slightly get the upper hand on the Mad Titan. But, there are plenty of MCU fans that would agree with Shane Black's stance on the uneven fight. We probably wouldn't even still be talking about it had Star-Lord not blown the whole operation. Regardless, Infinity War is the biggest movie of the year without any real signs of competition, so the Russo Brothers and Spider-Man are having the last laugh.<br>Shane Black was just having some fun with Infinity War and Josh Brolin's Thanos. But that brings up the real question, which is who would win between the Mad Titan and a Predator? Though we have yet to see the Upgrade Predator in total action yet, it's safe to say that it might have a chance to bring down Thanos pretty easily. He could rip off his giant purple head, spine and all. But if it's just a normal Predator, there's probably no chance of survival against Thanos.<br>Everybody is entitled to their opinions, but Shane Black's Iron Man 3 wasn't exactly everybody's favorite MCU movie. In fact, many hardcore fans really dislike it. However, like Infinity War, it made over $1 billion at the box office, so Black gets to laugh about all of it just like the Russo Brothers and poor Spider-Man, may he rest in peace. Black's The Predator opens in theaters on September 14th, which is just a few months away. This report originated from Comic Book.",
      "image": "/images/Infinity-War-Director-Shane-Black-Responds.jpg"
    },
    {
      "id": 3,
      "title": "The Story Behind Bringing ‘Ocean’s 8’ To Life",
      "author": "Stephen Patterson",
      "time": "2018-07-17",
      "content": "<div><span class=\"short-text\">On June 8, the wildly improbable sequel Ocean’s 8 hits theaters, and we’re giddy like a safecracker the night before a heist. The film follows Debbie Ocean who, with the help of a handful of talented friends, tries to pull off the heist of the century. That’s a serious ambition, given that her brother Danny Ocean has already pulled off a handful of massive robberies in the Oceans’s Eleven series.</span><span class=\"long-text\"><br>Despite connections to the popular Oceans franchise, Oceans 8 will be something quite different. The characters from the previous movies won’t return, but there’s an incredible new cast: Sandra Bullock, Cate Blanchett, Anne Hathaway, Mindy Kaling, Sarah Paulson, Awkwafina, Rihanna, Helena Bonham Carter, Richard Armitage, and James Corden.<br>We’re just wondering why has it taken so long to see another Oceans movie.</span><span class=\"text-dots\">....</span><span class=\"show-more-button\" data-more=\"0\">Read More</span></div>",
      "content2": "On June 8, the wildly improbable sequel Ocean’s 8 hits theaters, and we’re giddy like a safecracker the night before a heist. The film follows Debbie Ocean who, with the help of a handful of talented friends, tries to pull off the heist of the century. That’s a serious ambition, given that her brother Danny Ocean has already pulled off a handful of massive robberies in the Oceans’s Eleven series.<br>Despite connections to the popular Oceans franchise, Oceans 8 will be something quite different. The characters from the previous movies won’t return, but there’s an incredible new cast: Sandra Bullock, Cate Blanchett, Anne Hathaway, Mindy Kaling, Sarah Paulson, Awkwafina, Rihanna, Helena Bonham Carter, Richard Armitage, and James Corden.<br>We’re just wondering why has it taken so long to see another Oceans movie.",
      "image": "/images/Oceans-8b.png"
    },
    {
      "id": 4,
      "title": "Third Annabelle film will have the Demon Doll haunting the warrens",
      "author": "Cody Hamman",
      "time": "2018-07-19",
      "content": "<div><span class=\"short-text\">A few months ago, New Line Cinema made the surprise announcement that the next entry in the \"Conjuring Universe\", following the September release of THE NUN, will be a third film in the ANNABELLE franchise... It was a surprise because we figured the next movie in this universe would be the THE CONJURING 2 spin-off THE CROOKED MAN, since the script for that one has been in development for over a year.</span><span class=\"long-text\"><br>But the CROOKED MAN movie remains without a release date, while the third ANNABELLE is heading toward a July 3, 2019 release.<br>ANNABELLE and ANNABELLE: CREATION writer Gary Dauberman will be making his feature directorial debut with the new demon doll film, and during New Line Cinema's horror presentation at the San Diego Comic-Con yesterday Dauberman provided some information on Annabelle's next adventure. The JoBlo Network's own Paul Shirey reports that ANNABELLE 3 (that's not the official title) will center on the Warrens bringing Annabelle back to their artifact room, where she targets their 10-year old daughter.<br>Producer James Wan mentioned that the doll will be bringing other artifacts in the room to life, like a horror version of NIGHT AT THE MUSEUM.<br>So if ANNABELLE 3 takes place at the Warren home, does that mean the film is going to star Patrick Wilson and Vera Farmiga as Ed and Lorraine Warren? While I would be surprised if Wilson and Farmiga were to star in the ANNABELLE film, since I figured they'd be kept in the CONJURING films and wouldn't be branching out into the spin-offs, with this story they'd at least have to make a cameo... I am very intrigued.<br>We'll be keeping a eye on ANNABELLE 3 as it gets closer to production.</span><span class=\"text-dots\">....</span><span class=\"show-more-button\" data-more=\"0\">Read More</span></div>",
      "content2": "A few months ago, New Line Cinema made the surprise announcement that the next entry in the \"Conjuring Universe\", following the September release of THE NUN, will be a third film in the ANNABELLE franchise... It was a surprise because we figured the next movie in this universe would be the THE CONJURING 2 spin-off THE CROOKED MAN, since the script for that one has been in development for over a year.<br>But the CROOKED MAN movie remains without a release date, while the third ANNABELLE is heading toward a July 3, 2019 release.<br>ANNABELLE and ANNABELLE: CREATION writer Gary Dauberman will be making his feature directorial debut with the new demon doll film, and during New Line Cinema's horror presentation at the San Diego Comic-Con yesterday Dauberman provided some information on Annabelle's next adventure. The JoBlo Network's own Paul Shirey reports that ANNABELLE 3 (that's not the official title) will center on the Warrens bringing Annabelle back to their artifact room, where she targets their 10-year old daughter.<br>Producer James Wan mentioned that the doll will be bringing other artifacts in the room to life, like a horror version of NIGHT AT THE MUSEUM.<br>So if ANNABELLE 3 takes place at the Warren home, does that mean the film is going to star Patrick Wilson and Vera Farmiga as Ed and Lorraine Warren? While I would be surprised if Wilson and Farmiga were to star in the ANNABELLE film, since I figured they'd be kept in the CONJURING films and wouldn't be branching out into the spin-offs, with this story they'd at least have to make a cameo... I am very intrigued.<br>We'll be keeping a eye on ANNABELLE 3 as it gets closer to production.",
      "image": "/images/annabelle-creation-768x539-c-default.jpg"
    },
    {
      "id": 5,
      "title": "The new 'Mission: Impossible' has an awesome hidden connection to the original film",
      "author": "Matt Singer",
      "time": "2018-07-19",
      "content": "<div><span class=\"short-text\"><i>The following post contains mild SPOILERS for Mission: Impossible – Fallout.</i> Honestly, it’s barely even a spoiler. You’re fine. It’s okay.<br>Long-running franchises tend to have extremely short memories. The more complex and convoluted the backstory, the bigger the barrier to entry for casual fans. So continuity is kept to a bare minimum. Accessibility overrides every other concern.</span><span class=\"long-text\"><br>Throughout its history, that has certainly been true of the Mission: Impossible series. You don’t need to have a working knowledge of the old Mission: Impossible TV show, or know there was a Mission: Impossible TV show in the first place, to enjoy any of the Tom Cruise movies. In one film, Cruise’s super-spy Ethan Hunt even gets married, but that plot barely factors into the two Missions that follow. Each works as a standalone story. You could basically watch the first five films in any order, and apart from a few minor points, you’d understand everything in every movie.<br>The latest film, Mission: Impossible – Fallout, is a little bit different. It’s still very clear for newbies, but it also draws more on previous movies than any other Mission: Impossible. The villain of the previous film, Rogue Nation, returns for this one. His organization, the evil spy ring the Syndicate, has morphed into a new group called the Apostles. British spy Ilsa Faust (Rebecca Ferguson), who mystified Ethan Hunt in Rogue Nation, is back with new inscrutable motives. For the first time in a dozen years, Ethan’s long-absent wife Julia (Michelle Monaghan) factors into the plot as well.<br>Writer/director Christopher McQuarrie even includes a nod to the original Mission: Impossible movie from 1996. It’s pretty subtle; subtle enough that you need to know the original film well to catch it, and subtle enough that if you don’t know the original film you won’t notice and won’t be confused. For those in the know, though, it’s a nice little Easter egg.<br>It’s a callback to Max, an arms dealer who becomes Ethan Hunt’s unlikely ally in the first film. Hunt is disavowed after a mission goes south and he is framed for the death of the rest of his team. He goes on the run and then uses a complex computer tool known as an “internet link” to connect with Max, who was the intended buyer for a classified list of spies. After emailing the very-real email address “Max @ Job 3:14,” Hunt makes a meeting with Max, who turns out to be a lovely, erudite woman played by Vanessa Redgrave.</span><span class=\"text-dots\">....</span><span class=\"show-more-button\" data-more=\"0\">Read More</span></div>",
      "content2": "<i>The following post contains mild SPOILERS for Mission: Impossible – Fallout.</i> Honestly, it’s barely even a spoiler. You’re fine. It’s okay.<br>Long-running franchises tend to have extremely short memories. The more complex and convoluted the backstory, the bigger the barrier to entry for casual fans. So continuity is kept to a bare minimum. Accessibility overrides every other concern.<br>Throughout its history, that has certainly been true of the Mission: Impossible series. You don’t need to have a working knowledge of the old Mission: Impossible TV show, or know there was a Mission: Impossible TV show in the first place, to enjoy any of the Tom Cruise movies. In one film, Cruise’s super-spy Ethan Hunt even gets married, but that plot barely factors into the two Missions that follow. Each works as a standalone story. You could basically watch the first five films in any order, and apart from a few minor points, you’d understand everything in every movie.<br>The latest film, Mission: Impossible – Fallout, is a little bit different. It’s still very clear for newbies, but it also draws more on previous movies than any other Mission: Impossible. The villain of the previous film, Rogue Nation, returns for this one. His organization, the evil spy ring the Syndicate, has morphed into a new group called the Apostles. British spy Ilsa Faust (Rebecca Ferguson), who mystified Ethan Hunt in Rogue Nation, is back with new inscrutable motives. For the first time in a dozen years, Ethan’s long-absent wife Julia (Michelle Monaghan) factors into the plot as well.<br>Writer/director Christopher McQuarrie even includes a nod to the original Mission: Impossible movie from 1996. It’s pretty subtle; subtle enough that you need to know the original film well to catch it, and subtle enough that if you don’t know the original film you won’t notice and won’t be confused. For those in the know, though, it’s a nice little Easter egg.<br>It’s a callback to Max, an arms dealer who becomes Ethan Hunt’s unlikely ally in the first film. Hunt is disavowed after a mission goes south and he is framed for the death of the rest of his team. He goes on the run and then uses a complex computer tool known as an “internet link” to connect with Max, who was the intended buyer for a classified list of spies. After emailing the very-real email address “Max @ Job 3:14,” Hunt makes a meeting with Max, who turns out to be a lovely, erudite woman played by Vanessa Redgrave.",
      "image": "/images/mission-impossible-6-fallout-cruise-ferguson.jpg"
    },
    {
      "title": "Gal Gadot - Wonder Woman",
      "author": "Looper",
      "time": "2018-06-13",
      "image": "/images/gal-gadot-wonder-woman-1526514715.jpg",
      "content2": "<p>If you had a nickel for every time Wonder Woman's costume caused a controversy, you'd have…probably ten nickels or so. From the comics to the screen, the DC superhero's attire has been the focus of attention numerous times over the years, so it's no surprise that from the second Gal Gadot signed on to play Wonder Woman in the DC Extended Universe, a number of pundits and fans immediately chimed in about how wrong she was. Her performance in Batman v Superman silenced many who claimed she was too thin and didn't have a hero's figure, but the controversy didn't end there. The Amazonian's latest costume seemed fairly appropriate, though a lot of people were unhappy about the shoes—Wonder Woman has to run around and kick ample butt in heels, which many argued were unnecessary and put the emphasis on sexiness over strength.</p><p><br></p><p>Though the heels might not be the most practical thing for a superhero, the rest of the movie costume was thoroughly thought out. Designer Michael Wilkinson spoke to Pret-a-Reporter about his ideas behind her signature look. \"We wanted to create something incredibly strong and portray her as a legitimate fighter,\" he assured fans. \"There was a lot of love that went into all the details, making her really look like a powerful, legitimate warrior.\" Now people have moved on to complaining that Wonder Woman doesn't have underarm hair—it seems the hero will never get a break.</p>",
      "content": "<p>If you had a nickel for every time Wonder Woman's costume caused a controversy, you'd have…probably ten nickels or so. From the comics to the screen, the DC superhero's attire has been the focus of attention numerous times over the years, so it's no surprise that from the second Gal Gadot signed on to play Wonder Woman in the DC Extended Universe, a number of pundits and fans immediately chimed in about how wrong she was. Her performance in Batman v Superman silenced many who claimed she was too thin and didn't have a hero's figure, but the controversy didn't end there. The Amazonian's latest costume seemed fairly appropriate, though a lot of people were unhappy about the shoes—Wonder Woman has to run around and kick ample butt in heels, which many argued were unnecessary and put the emphasis on sexiness over strength.</p><p><br></p><p>Though the heels might not be the most practical thing for a superhero, the rest of the movie costume was thoroughly thought out. Designer Michael Wilkinson spoke to Pret-a-Reporter about his ideas behind her signature look. \"We wanted to create something incredibly strong and portray her as a legitimate fighter,\" he assured fans. \"There was a lot of love that went into all the details, making her really look like a powerful, legitimate warrior.\" Now people have moved on to complaining that Wonder Woman doesn't have underarm hair—it seems the hero will never get a break.</p>",
      "id": 6
    }
  ],
  "sideposts": [
    {
      "id": 1,
      "title2": "Alita: Battle Angel",
      "genre": "Action",
      "release": "July 20th, 2018",
      "content2": "<div><span class=\"short-text\">\"Battle Angel\" is based on the Japanese Manga series of graphic novels by Yukito Kishiro. The movie combines the first three books, Ido, Alita, and Hugo.</span><span class=\"long-text\"><br>Set in the 26th century, the story takes place 300 years after a societal collapse caused by a major war. But in that society, it's a technological dark age following a pinnacle of achievement far, far beyond where we are right now. It's a post-apocalyptic world from a very high level with cyborg technology as just a way of life. People are augmented a lot as workers and so on, so being a cyborg is not unusual.<br>The main character is a cyborg. She has an organic human brain, and she looks like she's about fourteen years old. She has a completely artificial body and she's lost her memory - she's found in a wreckage and she's reconstituted by a cyber-surgeon who becomes her surrogate father.</span><span class=\"text-dots\">....</span><span class=\"show-more-button\" data-more=\"0\">Read More</span></div>",
      "image2": "/images/Alita-Battle-Angel.jpg"
    },
    {
      "id": 2,
      "title2": "The Meg",
      "genre": "Action",
      "release": "August 10th, 2018",
      "content2": "<div><span class=\"short-text\">A deep-sea submersible – part of an international undersea observation program – has been attacked by a massive creature, previously thought to be extinct, and now lies disabled at the bottom of the deepest trench in the Pacific… with its crew trapped inside. With time running out, expert deep sea rescue diver Jonas Taylor (Statham) is recruited by a visionary Chinese oceanographer (Winston Chao), against the wishes of his daughter Suyin (Li Bingbing), to save the crew – and the ocean itself – from this unstoppable threat: a pre-historic 75-foot-long shark known as the Megalodon.</span><span class=\"long-text\"><br>What no one could have imagined is that, years before, Taylor had encountered this same terrifying creature. Now, teamed with Suyin, he must confront his fears and risk his own life to save everyone trapped below… bringing him face to face once more with the greatest and largest predator of all time.</span><span class=\"text-dots\">....</span><span class=\"show-more-button\" data-more=\"0\">Read More</span></div>",
      "image2": "/images/The-Meg.jpg"
    },
    {
      "id": 3,
      "title2": "Venom",
      "genre": "Action",
      "release": "October 5th, 2018",
      "content2": "<div><span class=\"short-text\">A potential \"Spider-Man\" spinoff, Sony is developing the project, based on the villain who appeared in \"Spider-Man 3\" and is hoping the character could serve as an antidote to the aging \"Spider-Man\" franchise in the way that Fox has used Wolverine to add longevity to its \"X-Men\" franchise.</span><span class=\"long-text\"><br>One of Marvel's most enigmatic, complex and badass characters comes to the big screen, starring Academy Award® nominated actor Tom Hardy as the lethal protector Venom.</span><span class=\"text-dots\">....</span><span class=\"show-more-button\" data-more=\"0\">Read More</span></div>",
      "image2": "/images/Venom.jpg"
    },
    {
      "id": 4,
      "title2": "Halloween",
      "genre": "Horror",
      "release": "October 19th, 2018",
      "content2": "<div><span class=\"short-text\">Jamie Lee Curtis returns to her iconic role as Laurie Strode, who comes to her final confrontation with Michael Myers, the masked figure who has haunted her since she narrowly escaped his killing spree on Halloween night four decades ago.</span><span class=\"long-text\"><br>Master of horror John Carpenter will executive produce and serve as creative consultant on this film, joining forces with cinema’s current leading producer of horror, Jason Blum (Get Out, Split, The Purge, Paranormal Activity). Inspired by Carpenter’s classic, filmmakers David Gordon Green and Danny McBride crafted a story that carves a new path from the events in the landmark 1978 film, and Green also directs.</span><span class=\"text-dots\">....</span><span class=\"show-more-button\" data-more=\"0\">Read More</span></div>",
      "image2": "/images/Halloween.jpg"
    },
    {
      "id": 5,
      "title2": "The Girl in the Spider's Web",
      "genre": "Crime",
      "release": "October 19th, 2018",
      "content2": "<div><span class=\"short-text\">Journalist Mikael Blomkvist and hacker Lisbeth Salander encounter a web of spies, cybercriminals and government corruption.</span><span class=\"long-text\"><br>Lisbeth Salander, the cult figure and title character of the acclaimed Millennium book series created by Stieg Larsson, will return to the screen in The Girl in the Spider's Web, a first-time adaptation of the recent global bestseller. Golden Globe winner Claire Foy, the star of \"The Crown,\" will play the outcast vigilante defender under the direction of Fede Alvarez, the director of 2016's breakout thriller Don't Breathe; the screenplay adaptation is by Steven Knight and Fede Alvarez & Jay Basu.</span><span class=\"text-dots\">....</span><span class=\"show-more-button\" data-more=\"0\">Read More</span></div>",
      "image2": "/images/The-Girl-In-The-Spiders-Web.jpg"
    },
    {
      "id": 6,
      "title2": "Aquaman",
      "genre": "Action",
      "release": "December 21st, 2018",
      "content2": "<div><span class=\"short-text\">Aquaman is a planned movie and is the seventh film in the DC Extended Universe about Arthur Curry's destiny as the King of Atlantis.</span><span class=\"long-text\"><br>Sunrise Entertainment's producers Alan and Peter Riche are devoloping Aquaman to the big screen for Warner Bros. Pictures. Ben Grant, a first time scribe, was hired to write the screenplay. However the film fell through. In 2007 Santiago Cabrera was cast as Aquaman in its upcoming JLA film. However, later in the year the movie was shelved. In July 2009 it was reported that Aquaman is in development at Leonardo DiCaprio's Appian Way. Warner chairman and CEO Barry Meyer says that the Aquaman film is in development.<br>The project was announced on October 15, 2014 with Jason Momoa as Arthur Curry, Orin, Aquaman.</span><span class=\"text-dots\">....</span><span class=\"show-more-button\" data-more=\"0\">Read More</span></div>",
      "image2": "/images/Aquaman.jpg"
    }
  ],
  "user": [
    {
      "id": 1,
      "name": "Alex",
      "surname": "Kion",
      "email": "at@at",
      "password": "burger"
    },
    {
      "name": "mufasa",
      "surname": "simba",
      "email": "mufasa@simba",
      "password": "alex",
      "id": 2
    }
  ]
}
